package H_W.HW_2;

// Дана строка (получение через обычный текстовый файл)
// "фамилия":"Иванов","оценка":"5","предмет":"Математика"
// "фамилия":"Петрова","оценка":"4","предмет":"Информатика"

// Написать метод(ы), который распарсит строку и, используя StringBuilder, создаст строки вида:
// Студент [фамилия] получил [оценка] по предмету [предмет].

// Пример вывода в консоль:
// Студент Иванов получил 5 по предмету Математика.
// Студент Петров получил 4 по предмету Информатика.
// Студент Краснов получил 5 по предмету Физика.

public class task_2 {
    
}
